{
  "intents": [
    {
      "tag": "Mirkwood Detail",
      "patterns": [
        "What is Mirkwood?",
        "Can you tell me about Mirkwood?",
        "Detail me about Mirkwood?",
        "What is in Mirkwood"
      ],
      "responses": [
        "It's a dense and heavy woodland. Full of danger."
      ]
    },
    {
      "tag": "Mirkwood location",
      "patterns": [
        "Where is Mirkwood",
        "Where is Mirkwood located?",
        "What is the location of Mirkwood?",
        "What parts is Mirkwood in?"
      ],
      "responses": [
        "It's in the eastern portion of Rhovanion or Wilderland. It's existed since the earliest days."
      ]
    },
    {
      "tag": "Mirkwood Dangerous",
      "patterns": [
        "Why is Mirkwood dangerous?",
        "Is Mirkwood dangerous?",
        "What dangers are in Mirkwood?",
        "Tell me about the dangers in Mirkwood?",
        "Is it dangerous in Mirkwood?"
      ],
      "responses": [
        "The forest is dangerous as it is cursed, and many travelers have lost their way and never returned.",
        "Mirkwood is dangerous because it's home to giant spiders, orcs, and other creatures."
      ]
    },
    {
      "tag": "Mirkwood Preparation",
      "patterns": [
        "What should I bring if I want to explore Mirkwood?"
        
      ],
      "responses": [
        "You should bring a good map, weapons, and supplies for at least a week."
      ]
    },
    {
      "tag": "Mirkwood Adventurers",
      "patterns": [
        "Have any famous adventurers explored Mirkwood?",
        "Has anyone explored Mirkwood?",
        "Has anyone else explored Mirkwood?",
        "Has anyone else travelled through Mirkwood?",
        "Who has explored through Mirkwood?"
      ],
      "responses": [                                                                                                    
        "Yes, Bilbo Baggins and the Dwarf king Thranduil and his companions passed through Mirkwood on their way to the Lonely Mountain.",
        "The Dwarf king Thranduil also rules over a part of Mirkwood, and Legolas Greenleaf, is known to have traveled through the forest."
      ]
    },
    {
      "tag": "Mirkwood History",
      "patterns": [
        "tell me the history of mirkwood",
        "can you tell me the history of mirkwood",
        "what is the history of mirkwood"
        
      ],
      "responses": [
        "Mirkwood is a dark and mysterious forest located in the heart of Middle-earth. It was once known as Greenwood the Great, but after the Necromancer's influence took hold, it became a place of darkness and danger. The Wood-elves who live there are skilled archers and fierce defenders of their homeland",
        "The history of Mirkwood is a long and storied one. Once a vibrant and prosperous forest, it was corrupted by the influence of the Necromancer and became a place of darkness and danger. The Wood-elves who lived there were forced to become reclusive and wary of outsiders"
      ]
    }
  ]
}